export const posts = [
    {
        id: 1,
        title: 'Что такое React JS?',
        description: "React — JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов. React разрабатывается и поддерживается Facebook, Instagram и сообществом отдельных разработчиков и корпораций. React может использоваться для разработки одностраничных и мобильных приложений.",
        liked: false
    },
    {
        id: 2,
        title: 'Что такое Axios и с чем его едят?',
        description: "Axios — это широко известная JavaScript-библиотека. Она представляет собой HTTP-клиент, основанный на промисах и предназначенный для браузеров и для Node.",
        liked: false
    },
    {
        id: 3,
        title: 'Что такое Хуки?',
        description: "Хуки — это функции, с помощью которых вы можете «подцепиться» к состоянию и методам жизненного цикла React из функциональных компонентов. Хуки не работают внутри классов — они дают вам возможность использовать React без классов.",
        liked: false
    }
];